{"data":{"markdownRemark":{"html":"<div class=\"content\">\n<h2>Yleistä</h2>\n<p>Kurssilla tutustutaan Javascriptilla tapahtuvaan moderniin websovelluskehitykseen. Pääpaino on React-kirjaston avulla toteutettavissa single page -sovelluksissa, ja niitä tukevissa Node.js:llä toteutetuissa REST-rajapinnoissa.</p>\n<p>Kurssilla käsitellään myös sovellusten testaamista, konfigurointia ja suoritusympäristöjen hallintaa sekä NoSQL-tietokantoja.</p>\n<h2>Oletetut esitiedot</h2>\n<p>Osallistujilta edellytetään vahvaa ohjelmointirutiinia, web-ohjelmoinnin ja tietokantojen perustuntemusta, git-versionhallintajärjestelmän peruskäytön hallintaa, kykyä pitkäjänteiseen työskentelyyn sekä valmiutta omatoimiseen tiedonhakuun ja ongelmanratkaisuun.</p>\n<p>Osallistuminen ei kuitenkaan edellytä kurssilla käsiteltävien tekniikoiden tai Javascript-kielen hallintaa.</p>\n<h2>Kurssimateriaali</h2>\n<p>Kurssimateriaali on tarkoitettu luettavaksi osa kerrallaan \"alusta loppuun\". Materiaalin seassa on tehtäviä, jotka on sijoiteltu siten, että kunkin tehtävän tekemiseen pitäsi olla riittävät tekniset valmiudet sitä edeltävässä materiaalissa. Voit siis tehdä tehtäviä sitä mukaan kun niitä tulee materiaalissa vastaan. Voi myös olla, että koko osan tehtävät kannattaa tehdä vasta sen jälkeen, kun olet ensin lukenut osan alusta loppuun kertaalleen. Useissa osissa tehtävät ovat samaa ohjelmaa laajentavia pienistä osista koostuvia kokonaisuuksia. Muutamia tehtävien ohjelmia kehitetään eteenpäin useamman osan aikana.</p>\n<p>Materiaali perustuu muutamien osasta osaan vaihtuvien esimerkkiohjelmien asteittaiseen laajentamiseen. Materiaali toiminee parhaiten, jos kirjoitat samalla koodin myös itse ja teet koodiin myös pieniä modifikaatioita. Materiaalin käyttämien ohjelmien koodin eri vaiheiden tilanteita on tallennettu GitHubiin.</p>\n<h2>Suoritustapa</h2>\n<p>Kurssi koostuu kahdeksasta osasta, joista ensimmäinen on historiallisista syistä numero nolla. Osat voi tulkita löyhästi ajatellen viikoiksi. Osia kuitenkin ilmestyy nopeampaa tahtia, ja suoritusnopeuskin on melko vapaa.</p>\n<p>Materiaalissa osasta <em>n</em> osaan <em>n+1</em> eteneminen ei ole mielekästä ennen kuin riittävä osaaminen osan <em>n</em> asioista on saavutettu. Kurssilla sovelletaankin pedagogisin termein <em>tavoiteoppimista</em>, <a href=\"https://en.wikipedia.org/wiki/Mastery_learning\">engl. mastery learning</a> ja on tarkoitus, että etenet seuraavaan osaan vasta, kun riittävä määrä edellisen osan tehtävistä on tehty.</p>\n<p>Oletuksena on, että teet kunkin osan tehtävistä <em>ainakin ne</em> jotka eivät ole merkattu tähdellä. Myös tähdellä merkatut tehtävät vaikuttavat arvosteluun, mutta niiden tekemättäjättäminen ei aiheuta liian suuria esteitä seuraavan osan (tähdellä merkkaamattomien) tehtävien tekemiseen.</p>\n<p>Estääksemme sen, että aloitat kurssin tekemisen vasta viimeisellä viikolla, on jokaisella osalla myös hard deadline. Etenemiselle on siis jonkun verran joustoa, jotta ehdit tekemään kustakin osasta tarvittavan määrän tehtäviä.</p>\n<p>Osien <em>hard deadlinet</em> seuraavassa:</p>\n<table>\n<thead>\n<tr>\n<th>osa</th>\n<th align=\"center\">deadline   </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>osa 0 ja osa 1</td>\n<td align=\"center\">30.1.</td>\n</tr>\n<tr>\n<td>osa 2</td>\n<td align=\"center\">5.2.</td>\n</tr>\n<tr>\n<td>osa 3</td>\n<td align=\"center\">12.2.</td>\n</tr>\n<tr>\n<td>osa 4</td>\n<td align=\"center\">25.2.</td>\n</tr>\n<tr>\n<td>osa 5</td>\n<td align=\"center\">4.3.</td>\n</tr>\n<tr>\n<td>osa 6</td>\n<td align=\"center\">11.3.</td>\n</tr>\n<tr>\n<td>osa 7</td>\n<td align=\"center\">11.3.</td>\n</tr>\n</tbody>\n</table>\n<p>Tämän kurssin eri osiin jo tehtyjen palautusten ajankäyttöstatistiikan näet <a href=\"https://studies.cs.helsinki.fi/courses/#fullstack2019\">tehtävien palautussivulta</a>.</p>\n<p>Suuri jousto suoritusajoissa tuo opiskelijalle entistä suuremman vastuun omasta ajankäytöstä. Nyt ilmoitetuista deadlineista <strong>ei jousteta ollenkaan</strong>. Kannattaa muistaa se, että mitä lähempänä deadlinea tehtävien tekemisen aloittaa, sitä suurempi vaara on joutua eriasteisiin konfiguraatiohelvetteihin. Apuakin on rajallisemmin tarjolla kun kello lähenee deadlinepäivän keskiyötä.</p>\n<h2>Arvosteluperusteet</h2>\n<p>Arvosana määräytyy kaikkien tehtyjen tehtävien perusteella, myös tähdellä merkityt \"vapaavalintaiset\" tehtävät siis vaikuttavat arvosanaan. Noin 50% deadlineen mennessä tehdyistä tehtävistä tuo arvosanan 1 ja 80% arvosanan 5. Kurssin lopussa on koe, joka on suoritettava hyväksytysti. Koe ei kuitenkaan vaikuta arvosanaan.</p>\n<p>Kurssilta on mahdollisuus ansaita lisäopintopisteitä. Jos teet 87.5% kurssin tehtävistä, saat yhden lisäopintopisteen. Tekemällä 95% tehtävistä saat 2 lisäopintopistettä. Opetushallinnollisista syistä lisäopintopisteet rekisteröidään omana kurssinaan. Kurssin nimi määritellään myöhemmin.</p>\n<h2>Arvosanarajat</h2>\n<p>Tarkemmat arvosanarajat määritellään siinä vaiheessa kun kurssin tehtävien yhteenlaskettu määrä on selvillä.</p>\n<h2>Aiemmin suoritetun kurssin täydentäminen</h2>\n<p>Jos olet suorittanut kurssin...</p>\n<h2>Tehtävien palauttaminen</h2>\n<p>Tehtävät palautetaan GitHubin kautta ja merkitsemällä tehdyt tehtävät palautussovellukseen.</p>\n<p>Jos palautat eri osien tehtäviä samaan repositorioon, käytä järkevää hakemistojen nimentää.</p>\n<p>Tehtävät palautetaan yksi osa kerrallaan. Kun olet palauttanut osan tehtävät, et voi enää palauttaa saman osan tekemättä jättämiäsi tehtäviä.</p>\n<p>GitHubiin palautettuja tehtäviä tarkastetaan <a href=\"https://theory.stanford.edu/~aiken/moss/\">MOSS</a>-plagiaattitunnistusjärjestelmän avulla. Jos GitHubista löytyy kurssin mallivastausten koodia tai useammalta opiskelijalta löytyy samaa koodia, käsitellään tilanne yliopiston <a href=\"https://blogs.helsinki.fi/alakopsaa/opettajalle/epailen-opiskelijaa-vilpista-mita-tehda/\">vilppikäytäntöjen</a> mukaan.</p>\n<p>Suurin osa tehtävistä on moniosaisia, samaa ohjelmaa pala palalta rakentavia kokonaisuuksia. Tälläisissä tehtäväsarjoissa ohjelman lopullisen version palauttaminen riittää, voit toki halutessasi tehdä commitin jokaisen tehtävän jälkeisestä tilanteesta, mutta se ei ole välttämätöntä.</p>\n<h2>Alkutoimet</h2>\n<p>Tällä kurssilla suositellaan Chrome-selaimen käyttöä, sillä se tarjoaa parhaan välineistön web-sovelluskehitystä ajatellen.</p>\n<p>Kurssin tehtävät palautetaan GitHubiin, joten Git tulee olla asennettuna ja sitä on syytä osata käyttää. Ohjeita Gitin käyttämiseen löytyy muunmuassa <a href=\"https://github.com/mluukkai/ohjelmistotekniikka2018/blob/master/tehtavat/viikko1.md#gitin-alkeet\">täältä</a>.</p>\n<p>Asenna myös joku järkevä webkoodausta tukeva tekstieditori, enemmän kuin suositeltava valinta on <a href=\"https://code.visualstudio.com/\">Visual studio code</a>.</p>\n<p>Älä koodaa nanolla, Notepadilla tai Geditillä. NetBeanskaan ei ole omimmillaan Web-koodauksessa ja se on myös turhan raskas verrattuna esim. Visual Studio Codeen.</p>\n<p>Asenna koneeseesi heti myös <a href=\"https://nodejs.org/en/\">Node.js</a>. Materiaali on tehty versiolla 10.0, älä asenna mitään sitä vanhempaa versiota.</p>\n<p>Asennusohjeita on koottu <a href=\"/asennusohjeita\">tänne</a>.</p>\n<p>Noden myötä koneelle asentuu myös Node package manager <a href=\"https://www.npmjs.com/get-npm\">npm</a>, jota tulemme tarvitsemaan kurssin aikana aktiivisesti. Tuoreen noden kera asentuu myös <a href=\"https://www.npmjs.com/package/npx\">npx</a>, jota tarvitaan myös muutaman kerran.</p>\n<h2>Typoja materiaalissa</h2>\n<p>Jos löydät kirjoitusvirheen tai joku asia on sanottu epäselvästi tai kielioppisääntöjen vastaisesti, tee <em>pull request</em> repositoriossa <a href=\"https://github.com/fullstackopen/fullstackopen.github.io\">https://github.com/fullstackopen/fullstackopen.github.io</a> olevaan kurssimateriaaliin.</p>\n<p>Pull requestin tekeminen on helppoa. Esim. jos tällä sivulla on typo, mene sivun \"lähdekoodiin\" <a href=\"https://github.com/fullstackopen/fullstackopen.github.io/blob/master/osa0.md\">https://github.com/fullstackopen/fullstackopen.github.io/blob/master/osa0.md</a> klikkaa kynän kuvaa oikealta, tee muutokset ja klikkaa muutama kerta \"vihreää\" <a href=\"https://github.com/mluukkai/ohjelmistotuotanto2018/blob/master/laskarit/2.md#typokorjauksia\">Ohtu-kurssin ohjeen mukaan</a>.</p>\n</div>","frontmatter":{"title":"osa 0","subTitle":"Web-sovelluksen toimintaperiaatteita","path":"/osa0/yleistä","mainImage":{"publicURL":"/static/osa0-6604cf9e42b433a590fd08c9fe748a01.png"},"partColor":"blue","part":0,"letter":"a"}}},"pageContext":{}}